configuration/src/Catalogs/НаправленияРазработки/НаправленияРазработки.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>НаправленияРазработки</name>
  <attributes>
    <name>ИспользоватьВидыПроцессов</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>ИспользоватьГабаритноеПланирование</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <attributes>
    <name>КраткоеНаименование</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>70</length>
      </stringQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>ОсновноеЮридическоеЛицо</name>
    <type>
      <types>CatalogRef.ЮридическиеЛица</types>
    </type>
  </attributes>
  <tabularSections>
    <name>Заказчики</name>
    <attributes>
      <name>Заказчик</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>Ответственные</name>
    <attributes>
      <name>Сотрудник</name>
      <type>
        <types>CatalogRef.Пользователи</types>
      </type>
    </attributes>
    <attributes>
      <name>Руководитель</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
  <tabularSections>
    <name>ЮридическиеЛица</name>
    <attributes>
      <name>ЮридическоеЛицо</name>
      <type>
        <types>CatalogRef.ЮридическиеЛица</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/InformationRegisters/РолиПользователейПоНаправлениям/РолиПользователейПоНаправлениям.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>РолиПользователейПоНаправлениям</name>
  <resources>
    <name>Роль</name>
    <type>
      <types>CatalogRef.РолиПользователей</types>
    </type>
  </resources>
  <attributes>
    <name>АвторИзменения</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>НаправлениеРазработки</name>
    <type>
      <types>CatalogRef.НаправленияРазработки</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/НастройкиПользователя/НастройкиПользователя.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>НастройкиПользователя</name>
  <resources>
    <name>Значение</name>
    <type>
      <types>Characteristic.ВидыНастроекПользователя</types>
    </type>
  </resources>
  <attributes>
    <name>Автор</name>
    <comment>Автор последнего изменения</comment>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаИзменения</name>
    <comment>Дата и время последнего изменения</comment>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <dimensions>
    <name>Пользователь</name>
    <type>
      <types>CatalogRef.Пользователи</types>
    </type>
  </dimensions>
  <dimensions>
    <name>Настройка</name>
    <type>
      <types>ChartOfCharacteristicTypesRef.ВидыНастроекПользователя</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/InformationRegisters/ОчередьОтправкиЭлектронныхПисем/ОчередьОтправкиЭлектронныхПисем.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:InformationRegister>
  <name>ОчередьОтправкиЭлектронныхПисем</name>
  <resources>
    <name>Адрес</name>
    <comment>Адрес электронной почты получателя</comment>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>50</length>
      </stringQualifiers>
    </type>
  </resources>
  <resources>
    <name>Текст</name>
    <type>
      <types>String</types>
    </type>
  </resources>
  <resources>
    <name>Тема</name>
    <type>
      <types>String</types>
      <stringQualifiers>
        <length>250</length>
      </stringQualifiers>
    </type>
  </resources>
  <attributes>
    <name>Важность</name>
    <type>
      <types>EnumRef.ВажностьСообщения</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаОтправления</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>ДатаСоздания</name>
    <type>
      <types>Date</types>
    </type>
  </attributes>
  <attributes>
    <name>КоличествоПопыток</name>
    <type>
      <types>Number</types>
      <numberQualifiers>
        <precision>5</precision>
      </numberQualifiers>
    </type>
  </attributes>
  <attributes>
    <name>Комментарий</name>
    <type>
      <types>String</types>
    </type>
  </attributes>
  <attributes>
    <name>Отправлено</name>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <dimensions>
    <name>УникальныйИдентификатор</name>
    <type>
      <types>UUID</types>
    </type>
  </dimensions>
</mdclass:InformationRegister>

configuration/src/Enums/ВажностьСообщения/ВажностьСообщения.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Enum>
  <name>ВажностьСообщения</name>
  <enumValues>
    <name>Высокая</name>
  </enumValues>
  <enumValues>
    <name>Наивысшая</name>
  </enumValues>
  <enumValues>
    <name>Наименьшая</name>
  </enumValues>
  <enumValues>
    <name>Низкая</name>
  </enumValues>
  <enumValues>
    <name>Обычная</name>
  </enumValues>
</mdclass:Enum>

configuration/src/Catalogs/РолиПользователей/РолиПользователей.mdo
<?xml version="1.0" encoding="UTF-8"?>
<mdclass:Catalog>
  <name>РолиПользователей</name>
  <comment>Список возможных ролей пользователя</comment>
  <predefined>
    <items>
      <name>Аналитик</name>
      <description>Аналитик</description>
    </items>
    <items>
      <name>ВсеРоли</name>
      <description>Все роли</description>
    </items>
    <items>
      <name>Гость</name>
      <description>Гость</description>
    </items>
    <items>
      <name>ДиректорIT</name>
      <description>Директор IT</description>
    </items>
    <items>
      <name>Заказчик</name>
      <description>Заказчик</description>
    </items>
    <items>
      <name>Разработчик</name>
      <description>Разработчик</description>
    </items>
    <items>
      <name>РуководительIT</name>
      <description>Руководитель ИТ-отдела</description>
    </items>
    <items>
      <name>РуководительНаправления</name>
      <description>Руководитель направления</description>
    </items>
    <items>
      <name>РуководительНаправленияIT</name>
      <description>Руководитель направления IT</description>
    </items>
    <items>
      <name>СтаршийРазработчик</name>
      <description>Старший разработчик</description>
    </items>
    <items>
      <name>СТО</name>
      <description>СТО</description>
    </items>
    <items>
      <name>Тестировщик</name>
      <description>Тестировщик</description>
    </items>
  </predefined>
  <attributes>
    <name>ПринадлежитITОтделу</name>
    <comment>Истина - определяет роль пользователя в IT-структуре, Ложь - роль пользователя по отношению к объектам</comment>
    <type>
      <types>Boolean</types>
    </type>
  </attributes>
  <tabularSections>
    <name>ДоступныеИнструменты</name>
    <attributes>
      <name>Инструмент</name>
      <type>
        <types>CatalogRef.ИнструментыСистемы</types>
      </type>
    </attributes>
    <attributes>
      <name>Порядок</name>
      <type>
        <types>Number</types>
        <numberQualifiers>
          <precision>3</precision>
        </numberQualifiers>
      </type>
    </attributes>
    <attributes>
      <name>ЭтоОтчет</name>
      <type>
        <types>Boolean</types>
      </type>
    </attributes>
  </tabularSections>
</mdclass:Catalog>

configuration/src/Catalogs/НаправленияРазработки/ObjectModule.bsl
///////////////////////////////////////////////////////////////////////////////////////////////////////
// Copyright (c) 2025, ООО ДНС Технологии
// SDMS (Software Development Management System) — это корпоративная система учета разработки и управления проектами 
// Все права защищены. Эта программа и сопроводительные материалы предоставляются 
// в соответствии с условиями лицензии General Public License (GNU GPL v3)
// Текст лицензии доступен по ссылке:
// https://www.gnu.org/licenses/gpl-3.0.html
///////////////////////////////////////////////////////////////////////////////////////////////////////

#Область ОписаниеПеременных

// Использование юридических лиц Направлением до записи 
Перем СтароеЗначениеИспользованияЮридическихЛиц; 

#КонецОбласти

#Область ОбработчикиСобытий

Процедура ПередЗаписью(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// ДЕЙСТВИЯ, СВЯЗАННЫЕ С ОБРАЩЕНИЕМ К "СТАРЫМ" ЗНАЧЕНИЯМ РЕКВИЗИТОВ ОБЪЕКТА
	
	// Значение использования юр лиц до записи, если изменяется 
	// добавим записи в регистр ИспользованиеЮридическихЛицНаправлений 
	СтароеЗначениеИспользованияЮридическихЛиц = РегистрыСведений.ИспользованиеЮридическихЛицНаправлений.Использует(Ссылка);
 
	// ДЕЙСТВИЯ, СВЯЗАННЫЕ С ПРОВЕРКАМИ И ЗАПОЛНЕНИЕМ ЗНАЧЕНИЙ РЕКВИЗИТОВ ОБЪЕКТА
	
	ОбщегоНазначения.ОчисткаДублейТабличнойЧасти(Ответственные, "Сотрудник", "Руководитель");
	ОбщегоНазначения.ОчисткаДублейТабличнойЧасти(ЮридическиеЛица, "ЮридическоеЛицо");
	ОбщегоНазначения.ОчисткаДублейТабличнойЧасти(Заказчики, "Заказчик");
	
	// Получение старого(текущего) руководителя направления перед записью, для 
	// установки роли "Заказчик" в регистре РолиПользователейПоНаправлениям и
	// возможного снятия этой роли в конфигураторе в момент записи.
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	РолиПользователейПоНаправлениям.Пользователь КАК Руководитель
	|ИЗ
	|	РегистрСведений.РолиПользователейПоНаправлениям КАК РолиПользователейПоНаправлениям
	|ГДЕ
	|	РолиПользователейПоНаправлениям.НаправлениеРазработки = &НаправлениеРазработки
	|	И РолиПользователейПоНаправлениям.Роль = ЗНАЧЕНИЕ(Справочник.РолиПользователей.РуководительНаправления)";
	
	Запрос.УстановитьПараметр("НаправлениеРазработки", Ссылка);	
	РезультатЗапроса = Запрос.Выполнить();
	
	Если НЕ РезультатЗапроса.Пустой() Тогда
		Выборка = РезультатЗапроса.Выбрать();
		Выборка.Следующий();
		ТекущийРуководитель = Выборка.Руководитель;
	Иначе
		ТекущийРуководитель = Справочники.Пользователи.ПустаяСсылка();
	КонецЕсли;	
	
	ДополнительныеСвойства.Вставить("ТекущийРуководитель", ТекущийРуководитель);
	
	ПроверитьИзменениеСоставаЮридическихЛиц();
	
КонецПроцедуры

Процедура ПриЗаписи(Отказ)
	
	Если ОбменДанными.Загрузка Тогда
		Возврат;
	КонецЕсли;
	
	// Нужно проверить, является ли уже данный пользователь руководителем по данному направлению.
	// Если является, то не нужно делать повторную запись в регистр. В противном случае добавляем
	// в регистр сведений РолиПользователейПоНаправлениям запись, что пользователь является
	// руководителем направления.
	
	ТекущийПользователь = ПараметрыСеанса.ТекущийПользователь;
	
	// Поиск руководителя в ТЧ справочника 
	СтрокаРуководителя = Ответственные.Найти(Истина, "Руководитель"); 
	НовыйРуководитель = СтрокаРуководителя.Сотрудник;	
	ТекущийРуководитель = ДополнительныеСвойства.ТекущийРуководитель;
	
	Если НовыйРуководитель <> ТекущийРуководитель Тогда
		МенеджерЗаписи = РегистрыСведений.РолиПользователейПоНаправлениям.СоздатьМенеджерЗаписи();
		МенеджерЗаписи.НаправлениеРазработки = Ссылка;
		МенеджерЗаписи.Пользователь = ТекущийРуководитель;
		МенеджерЗаписи.Прочитать();
		
		// Проверим, есть ли в регистре сведений записи по руководителю направления
		Если МенеджерЗаписи.Выбран() Тогда
			
			// При смене руководителя устанавливаем старому руководителю роль "Заказчик"
			МенеджерЗаписи.Роль = Справочники.РолиПользователей.Заказчик;
			МенеджерЗаписи.Записать();
		КонецЕсли;
		
		НаборЗаписей = РегистрыСведений.РолиПользователейПоНаправлениям.СоздатьНаборЗаписей();
		НаборЗаписей.Отбор.НаправлениеРазработки.Установить(Ссылка);
		НаборЗаписей.Отбор.Пользователь.Установить(НовыйРуководитель);
		
		НоваяЗапись = НаборЗаписей.Добавить();
		НоваяЗапись.НаправлениеРазработки = Ссылка;
		НоваяЗапись.Пользователь = НовыйРуководитель;
		НоваяЗапись.Роль = Справочники.РолиПользователей.РуководительНаправления;
		НоваяЗапись.АвторИзменения = ТекущийПользователь;
		НоваяЗапись.ДатаИзменения = ТекущаяДатаСеанса();	
				
		НаборЗаписей.Записать();
		
		// Снятие или установка роли РуководительНаправления в конфигураторе
		Справочники.НаправленияРазработки.ОбработатьИзменениеРуководителяНаправления(ТекущийРуководитель, 
			НовыйРуководитель, Ссылка);
	КонецЕсли;
	
	Если ДополнительныеСвойства.Свойство("ИспользоватьЮридическиеЛица") 
		И СтароеЗначениеИспользованияЮридическихЛиц <> ДополнительныеСвойства.ИспользоватьЮридическиеЛица Тогда
		
		РегистрыСведений.ИспользованиеЮридическихЛицНаправлений.ДобавитьЗапись(Ссылка,
			ДополнительныеСвойства.ИспользоватьЮридическиеЛица);
	КонецЕсли;
	
	ОбработатьИзменениеСоставаЮридическихЛиц();
	
КонецПроцедуры

#КонецОбласти

#Область СлужебныеПроцедурыИФункции

Процедура ОбработатьИзменениеСоставаЮридическихЛиц()
	
	Перем ТаблицаЗначений;
	
	Если ДополнительныеСвойства.Свойство("ПользователиДляУдаленияНастроек", ТаблицаЗначений) 
		И ТаблицаЗначений.Количество() > 0 Тогда
		
		Для Каждого СтрокаТаблицы Из ТаблицаЗначений Цикл
			РегистрыСведений.НастройкиПользователя.УдалитьНастройку(СтрокаТаблицы.Пользователь, СтрокаТаблицы.ВидНастройки);
		КонецЦикла;
		
		ОповеститьОбИзмененииНастройкиЮридическогоЛица(ТаблицаЗначений);
		
	КонецЕсли;
	
КонецПроцедуры

Процедура ОповеститьОбИзмененииНастройкиЮридическогоЛица(Знач ТаблицаЗначений)
	
	Если ТаблицаЗначений.Количество() = 0 Тогда
		Возврат;
	КонецЕсли;
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнешниеДанные.Пользователь КАК Пользователь,
	|	ВнешниеДанные.ЮридическоеЛицо КАК ЮридическоеЛицо
	|ПОМЕСТИТЬ ДанныеОповещения
	|ИЗ
	|	&ВнешниеДанные КАК ВнешниеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	Пользователи.Почта КАК Почта,
	|	ДанныеОповещения.ЮридическоеЛицо КАК ЮридическоеЛицо
	|ИЗ
	|	ДанныеОповещения КАК ДанныеОповещения
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.Пользователи КАК Пользователи
	|		ПО ДанныеОповещения.Пользователь = Пользователи.Ссылка
	|ГДЕ
	|	НЕ Пользователи.Недействителен
	|	И НЕ Пользователи.ПометкаУдаления
	|	И НЕ Пользователи.ОтключитьВсеОповещения
	|	И Пользователи.Почта <> """"
	|ИТОГИ ПО
	|	ЮридическоеЛицо";
	
	Запрос.УстановитьПараметр("ВнешниеДанные", ТаблицаЗначений);
	
	ШаблоныПисьма = РегистрыСведений.ОчередьОтправкиЭлектронныхПисем.ШаблоныЭлектронногоПисьма();
	
	НавигационнаяСсылка = СтрШаблон("<!-- sdms_link_prefix -->#e1cib/app/%1", Метаданные.Обработки.НастройкиПользователя.ПолноеИмя());
	
	СсылкаНаНастройки = СтрЗаменить(ШаблоныПисьма.АктивнаяСсылка, "<!-- link -->", НавигационнаяСсылка);
	СсылкаНаНастройки = СтрЗаменить(СсылкаНаНастройки, "<!-- title_link -->", "настройки пользователя");

	ТекстШаблона = 
	"В связи с удалением <b>&#34;%1&#34;</b> из списка юридических лиц направления <b>&#34;%2&#34;</b>,
	|значение настроек <b>&#34;Юр. лицо&#34;</b> группы <b>&#34;Заполнение документов&#34;</b> было сброшено.
	|Перейти в %3.";
	
	ДанныеДляОповещения = Запрос.Выполнить().Выгрузить(ОбходРезультатаЗапроса.ПоГруппировкам);
	
	Для Каждого Строка Из ДанныеДляОповещения.Строки Цикл
		
		ЧастиПисьма = Новый Массив;
		
		ЮридическоеЛицо = Строка.ЮридическоеЛицо;
	
		ТекстШаблона = СтрШаблон(ТекстШаблона, ЮридическоеЛицо, Наименование, СсылкаНаНастройки);
		
		ШаблонПисьма = СтрЗаменить(ШаблоныПисьма.БлокОсновногоТекста, "<!-- content -->", ТекстШаблона);
		ШаблонПисьма = СтрЗаменить(ШаблонПисьма, "<!-- font_size -->", "14px");
		
		ЧастиПисьма.Добавить(ШаблонПисьма);
		
		ЧастиПисьма.Добавить(ШаблоныПисьма.РазделительнаяЛиния);
		
		ЧастиПисьма.Добавить(ШаблоныПисьма.ПодвалПисьма);
		
		ТекстОповещения = СтрСоединить(ЧастиПисьма, Символы.ПС);
		
		Получатели = Строка.Строки.ВыгрузитьКолонку("Почта");
		
		РегистрыСведений.ОчередьОтправкиЭлектронныхПисем.Добавить(Получатели, "Изменение настроек филиала", ТекстОповещения,
			Перечисления.ВажностьСообщения.Высокая);
		
	КонецЦикла;
	
КонецПроцедуры

Процедура ПроверитьИзменениеСоставаЮридическихЛиц()
	
	Запрос = Новый Запрос;
	Запрос.Текст = 
	"ВЫБРАТЬ
	|	ВнешниеДанные.ЮридическоеЛицо КАК ЮридическоеЛицо
	|ПОМЕСТИТЬ ТекущиеДанные
	|ИЗ
	|	&ВнешниеДанные КАК ВнешниеДанные
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыНастроекПользователя.НаправлениеДляЗаполненияЗаявки) КАК НастройкаНаправления,
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыНастроекПользователя.ЮрЛицоДляЗаполненияЗаявки) КАК НастройкаЮрЛица
	|ПОМЕСТИТЬ ПроверяемыеНастройки
	|
	|ОБЪЕДИНИТЬ ВСЕ
	|
	|ВЫБРАТЬ
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыНастроекПользователя.НаправлениеДляЗаполненияВЗ),
	|	ЗНАЧЕНИЕ(ПланВидовХарактеристик.ВидыНастроекПользователя.ЮрЛицоДляЗаполненияВЗ)
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ЮридическиеЛица.ЮридическоеЛицо КАК ЮридическоеЛицо
	|ПОМЕСТИТЬ ПредыдущиеДанные
	|ИЗ
	|	Справочник.НаправленияРазработки.ЮридическиеЛица КАК ЮридическиеЛица
	|ГДЕ
	|	ЮридическиеЛица.Ссылка = &Ссылка
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	ПредыдущиеДанные.ЮридическоеЛицо КАК ЮридическоеЛицо
	|ПОМЕСТИТЬ УдаленныеЮридическиеЛица
	|ИЗ
	|	ПредыдущиеДанные КАК ПредыдущиеДанные
	|		ЛЕВОЕ СОЕДИНЕНИЕ ТекущиеДанные КАК ТекущиеДанные
	|		ПО ПредыдущиеДанные.ЮридическоеЛицо = ТекущиеДанные.ЮридическоеЛицо
	|ГДЕ
	|	ТекущиеДанные.ЮридическоеЛицо ЕСТЬ NULL
	|;
	|
	|////////////////////////////////////////////////////////////////////////////////
	|ВЫБРАТЬ
	|	НастройкиПользователяНаправлениеЗаявки.Пользователь КАК Пользователь,
	|	НастройкиПользователяЮрЛицоЗаявки.Настройка КАК ВидНастройки,
	|	УдаленныеЮридическиеЛица.ЮридическоеЛицо КАК ЮридическоеЛицо
	|ИЗ
	|	ПроверяемыеНастройки КАК ПроверяемыеНастройки
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПользователя КАК НастройкиПользователяНаправлениеЗаявки
	|		ПО (НастройкиПользователяНаправлениеЗаявки.Настройка = ПроверяемыеНастройки.НастройкаНаправления)
	|			И ((ВЫРАЗИТЬ(НастройкиПользователяНаправлениеЗаявки.Значение КАК Справочник.НаправленияРазработки)) = &Ссылка)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ РегистрСведений.НастройкиПользователя КАК НастройкиПользователяЮрЛицоЗаявки
	|		ПО (НастройкиПользователяНаправлениеЗаявки.Пользователь = НастройкиПользователяЮрЛицоЗаявки.Пользователь)
	|			И (НастройкиПользователяЮрЛицоЗаявки.Настройка = ПроверяемыеНастройки.НастройкаЮрЛица)
	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ УдаленныеЮридическиеЛица КАК УдаленныеЮридическиеЛица
	|		ПО ((ВЫРАЗИТЬ(НастройкиПользователяЮрЛицоЗаявки.Значение КАК Справочник.ЮридическиеЛица)) = УдаленныеЮридическиеЛица.ЮридическоеЛицо)";
	
	Запрос.УстановитьПараметр("ВнешниеДанные", ЮридическиеЛица.Выгрузить());
	Запрос.УстановитьПараметр("Ссылка", Ссылка);
	
	ТаблицаЗначений = Запрос.Выполнить().Выгрузить();
	
	ДополнительныеСвойства.Вставить("ПользователиДляУдаленияНастроек", ТаблицаЗначений);
	
КонецПроцедуры

#КонецОбласти
